package front.fair.web;

import java.awt.image.BufferedImage;
import java.io.File;
import java.util.Arrays;
import java.util.List;

import javax.annotation.Resource;
import javax.imageio.ImageIO;
import javax.servlet.http.Cookie;
import javax.servlet.http.HttpServletRequest;
import javax.servlet.http.HttpServletResponse;

import org.springframework.stereotype.Controller;
import org.springframework.ui.ModelMap;
import org.springframework.web.bind.annotation.PathVariable;
import org.springframework.web.bind.annotation.RequestMapping;
import org.springframework.web.bind.annotation.RequestMethod;
import org.springframework.web.servlet.ModelAndView;

import egovframework.rte.fdl.idgnr.EgovIdGnrService;
import egovframework.rte.ptl.mvc.tags.ui.pagination.PaginationInfo;
import emf.core.exception.EmfException;
import emf.core.extend.web.EmfController;
import emf.core.vo.EmfMap;
import front.co.util.COPaginationUtil;
import front.fair.service.FAIRMainService;

/**
 * <pre> 
 * 메인화면 위한 Controller
 * </pre>
 * 
 * @ClassName		: FMAMainController.java
 * @Description		: 메인화면 위한 Controller
 * @author 김필기
 * @since 2016.03.03
 * @version 1.0
 * @see
 * @Modification Information
 * <pre>
 * 		since		   author				 description
 *   ==========    ==============    =============================
 *   2016.03.03		   김필기				  최초 생성
 * </pre>
 */ 
@Controller
@RequestMapping("/fair")
public class FAIRMainController extends EmfController {

	@Resource(name="fairMainService")
	private FAIRMainService fairMainService;
	
	@Resource(name="fariUserIdgen")
    private EgovIdGnrService fariUserIdgen;
	
	/**
	 * 메인 화면
	 *
 	 * @param emfMap
	 * @param modelMap
	 * @return
	 * @throws Exception
	 */
	@RequestMapping(value="/index.do")
	public String FairMain(HttpServletRequest request, EmfMap emfMap, ModelMap modelMap, HttpServletResponse response) throws Exception
	{
		if(request.getParameter("fromurl") != null && !request.getParameter("fromurl").isEmpty())
		{
			String fromurl = request.getParameter("fromurl");
			Cookie setCookie = new Cookie("fromurl", fromurl);
			setCookie.setMaxAge(-1);
			response.addCookie(setCookie);
		}
		
		String url = "front/fair/FairMain";
		
		//모바일 체크
		String userAgent = (String)request.getHeader("User-Agent");
		String[] mobileos = {"iPhone","iPod","Android","BlackBerry","Windows CE",
		"Nokia","Webos","Opera Mini","SonyEricsson","Opera Mobi","IEMobile"};
		int j = -1;
		if(userAgent != null && !userAgent.equals("")){
			for(int i = 0 ; i<mobileos.length ; i++){
				j = userAgent.indexOf(mobileos[i]);
				if(j > -1){
					url = "front/fair/FairMainMo";
				}
			}
		}
		return url;
	}
	
	/**
     * 카테고리별 전체 상품목록
     * 
     * @param EmfMap
	 * @return ModelAndView
	 * @throws Exception
     */    
    @RequestMapping(value="/productList.do")
    public String FairProductList(HttpServletRequest request, EmfMap emfMap, ModelMap modelMap) throws Exception 
    {
    	try
		{    		
    		emfMap.put("cntPage", 6);
			PaginationInfo paginationInfo = new COPaginationUtil().getPage(emfMap);
    		//페이징 처리
    		emfMap.put("paginationInfo", paginationInfo);    

    		//리스트 가져오기
    		List<EmfMap> list = fairMainService.selectProductList(emfMap);
    		for(EmfMap pl : list)
			{
				BufferedImage imgProduct = ImageIO.read(new File(pl.getString("fpMainImageBgPath")+"/"+pl.getString("fpMainImageBgSaveNm")));
				pl.put("fpMainHeight", imgProduct.getHeight());
				
				pl.put("fpMainSubtitle", pl.getString("fpMainSubtitle").replaceAll("\r\n", "<br>"));
				pl.put("fpMainDesc", pl.getString("fpMainDesc").replaceAll("\r\n", "<br>"));
			}
    		emfMap.put("list", list);
    		
    		if(list.size() > 0)
    		{
    			paginationInfo.setTotalRecordCount(Integer.parseInt(list.get(0).getString("totCnt")));
    		}
    		else
    		{
    			paginationInfo.setTotalRecordCount(0);
    		}
    		modelMap.addAttribute("rtnMap", emfMap);
		}
    	catch (Exception he) 
		{
			if (log.isDebugEnabled()) 
			{
				log.debug(he);
            }
			throw new EmfException(he.getMessage());
		}
    	
    	String url = "front/fair/FairMainProductList";
    	
    	//모바일 체크
		String userAgent = (String)request.getHeader("User-Agent");
		String[] mobileos = {"iPhone","iPod","Android","BlackBerry","Windows CE",
		"Nokia","Webos","Opera Mini","SonyEricsson","Opera Mobi","IEMobile"};
		int j = -1;
		if(userAgent != null && !userAgent.equals("")){
			for(int i = 0 ; i<mobileos.length ; i++){
				j = userAgent.indexOf(mobileos[i]);
				if(j > -1){
					url = "front/fair/FairMainProductListMo";
				}
			}
		}
    	
    	return url; 
    }
	
	/**
	 * 구매 화면
	 *
 	 * @param emfMap
	 * @param modelMap
	 * @return
	 * @throws Exception
	 */
	@RequestMapping(value="/{fpSeq}/index.do")
	public String FairDetail(HttpServletRequest request, EmfMap emfMap, ModelMap modelMap, @PathVariable int fpSeq) throws Exception
	{
		try
		{
			if(request.getParameter("fromurl") != null && !request.getParameter("fromurl").isEmpty())
			{
				modelMap.addAttribute("fromurl", request.getParameter("fromurl"));
			}
			
			//전체설정
			List<EmfMap> configList = fairMainService.configList();
			EmfMap config = new EmfMap();
			if(configList.size() > 0)
			{
				config = configList.get(0);
			}
			modelMap.addAttribute("config", config);
			
			emfMap.put("fpSeq", fpSeq);
			List<EmfMap> product = fairMainService.selectProductDetail(emfMap);
			if(product.size() > 0) {
				EmfMap rtnMap = product.get(0);
				rtnMap.put("fpMainSubtitle", rtnMap.getString("fpMainSubtitle").replaceAll("\r\n", " "));
				modelMap.addAttribute("product", product.get(0));
			}
		}
		catch (Exception he) 
		{
			if (log.isDebugEnabled()) 
			{
				log.debug(he);
            }
			throw new EmfException(he.getMessage());
		}
		
		String url = "front/fair/FairDetail";
    	
    	//모바일 체크
		String userAgent = (String)request.getHeader("User-Agent");
		String[] mobileos = {"iPhone","iPod","Android","BlackBerry","Windows CE",
		"Nokia","Webos","Opera Mini","SonyEricsson","Opera Mobi","IEMobile"};
		int j = -1;
		if(userAgent != null && !userAgent.equals("")){
			for(int i = 0 ; i<mobileos.length ; i++){
				j = userAgent.indexOf(mobileos[i]);
				if(j > -1){
					url = "front/fair/FairDetailMo";
				}
			}
		}
		return url;
	}
	
	/**
	 * 결합혜택 화면
	 *
 	 * @param emfMap
	 * @param modelMap
	 * @return
	 * @throws Exception
	 */
	@RequestMapping(value="/benefitList.do")
	public String FairDetailBenefit(EmfMap emfMap, ModelMap modelMap) throws Exception
	{
		try
		{
			emfMap.put("inSeq", emfMap.getString("fbSeq").split(","));
			List<EmfMap> list = fairMainService.selectProductDetailBenefit(emfMap);			
			modelMap.addAttribute("list", list);
		}
		catch (Exception he) 
		{
			if (log.isDebugEnabled()) 
			{
				log.debug(he);
            }
			throw new EmfException(he.getMessage());
		}
		
		return "front/fair/FairDetailBenefit";
	}
	
	/**
     * 등록
     * 
     * @param EmfMap
	 * @return ModelAndView
	 * @throws Exception
     */    
    @RequestMapping(value="/action.ajax", method=RequestMethod.POST)
    public ModelAndView FairAction(HttpServletRequest request, EmfMap emfMap) throws Exception 
    {
    	try
		{		
    		EmfMap rqstMap = new EmfMap();
    		String fupValue = "{\"INPUT\":[";
    		//input setting
			int input_count = Integer.parseInt(emfMap.getString("fuInputCount"));
			for(int i = 0; i < input_count; i++) {
				String key = emfMap.getString("input"+ i +"Key");
				String val = emfMap.getString("input"+ i);
				String tlt = emfMap.getString("input"+ i +"Title");
				
				if(i > 0) fupValue += ",";
				if(key.equals("EMAIL"))
				{
					fupValue += "{\"TITLE\":\""+ tlt +"\",\"KEY\":\""+ key +"\",\"VALUE\":\""+ emfMap.getString("input"+ i +"Id") +"@"+ emfMap.getString("input"+ i +"Domain") +"\"}";
				}
				else if(key.equals("HPHONE"))
				{
					fupValue += "{\"TITLE\":\""+ tlt +"\",\"KEY\":\""+ key +"\",\"VALUE\":\""+ emfMap.getString("input"+ i +"1") +"-"+ emfMap.getString("input"+ i +"2") +"-"+ emfMap.getString("input"+ i +"3") +"\"}";
					
					
					String phone1 = emfMap.getString("input"+ i +"1");
					String[] vaildPhone1 = {"02","031","032","033","041","042","043","044","051","052","053","054","055","061","062","063","064","070","010","011","016","017","018","019"};
					if(!Arrays.asList(vaildPhone1).contains(phone1))
					{ 
						ModelAndView mav = new ModelAndView();
				    	mav.addObject("result", "NOT PHONE");
						mav.setViewName("jsonView");

						return mav; 
					}
					
					String phone2 = emfMap.getString("input"+ i +"2");
					if(!phone2.matches("^[0-9]{3,4}$")) 
					{
						ModelAndView mav = new ModelAndView();
				    	mav.addObject("result", "NOT PHONE");
						mav.setViewName("jsonView");

						return mav; 
					}
					
					String phone3 = emfMap.getString("input"+ i +"3");
					if(!phone3.matches("^[0-9]{4}$")) 
					{
						ModelAndView mav = new ModelAndView();
				    	mav.addObject("result", "NOT PHONE");
						mav.setViewName("jsonView");

						return mav; 
					}
					
					String phone = emfMap.getString("input"+ i +"1") +"-"+ emfMap.getString("input"+ i +"2") +"-"+ emfMap.getString("input"+ i +"3");
					String[] vaildPhone = {"010-1111-1111","010-2222-2222","010-3333-3333","010-4444-4444","010-5555-5555","010-6666-6666","010-7777-7777","010-9999-9999","010-1234-5678","010-1111-2222","010-1111-3333","010-1111-4444","010-1111-5555","010-1111-6666","010-1111-7777","010-1111-8888","010-1111-9999","010-2222-1111","010-2222-3333","010-2222-4444","010-2222-5555","010-2222-6666","010-2222-7777","010-2222-8888","010-2222-9999","010-3333-1111","010-3333-2222","010-3333-4444","010-3333-5555","010-3333-6666","010-3333-7777","010-3333-8888","010-3333-9999","010-4444-1111","010-4444-2222","010-4444-3333","010-4444-5555","010-4444-6666","010-4444-7777","010-4444-8888","010-4444-9999","010-5555-1111","010-5555-2222","010-5555-3333","010-5555-4444","010-5555-6666","010-5555-7777","010-5555-8888","010-5555-9999","010-6666-1111","010-6666-2222","010-6666-3333","010-6666-4444","010-6666-5555","010-6666-7777","010-6666-8888","010-6666-9999","010-7777-1111","010-7777-2222","010-7777-3333","010-7777-4444","010-7777-5555","010-7777-6666","010-7777-8888","010-7777-9999","010-8888-1111","010-8888-2222","010-8888-3333","010-8888-4444","010-8888-5555","010-8888-6666","010-8888-7777","010-8888-8888","010-9999-1111","010-9999-2222","010-9999-3333","010-9999-4444","010-9999-5555","010-9999-6666","010-9999-7777","010-9999-8888","010-0000-0000","010-0000-1111","010-0000-2222","010-0000-3333","010-0000-4444","010-0000-5555","010-0000-6666","010-0000-7777","010-0000-8888","010-0000-9999","111-1111-1111","111-2222-2222","111-3333-3333","111-4444-4444","111-5555-5555","111-6666-6666","111-7777-7777","111-9999-9999","111-1234-5678","111-1111-2222","111-1111-3333","111-1111-4444","111-1111-5555","111-1111-6666","111-1111-7777","111-1111-8888","111-1111-9999","111-2222-1111","111-2222-3333","111-2222-4444","111-2222-5555","111-2222-6666","111-2222-7777","111-2222-8888","111-2222-9999","111-3333-1111","111-3333-2222","111-3333-4444","111-3333-5555","111-3333-6666","111-3333-7777","111-3333-8888","111-3333-9999","111-4444-1111","111-4444-2222","111-4444-3333","111-4444-5555","111-4444-6666","111-4444-7777","111-4444-8888","111-4444-9999","111-5555-1111","111-5555-2222","111-5555-3333","111-5555-4444","111-5555-6666","111-5555-7777","111-5555-8888","111-5555-9999","111-6666-1111","111-6666-2222","111-6666-3333","111-6666-4444","111-6666-5555","111-6666-7777","111-6666-8888","111-6666-9999","111-7777-1111","111-7777-2222","111-7777-3333","111-7777-4444","111-7777-5555","111-7777-6666","111-7777-8888","111-7777-9999","111-8888-1111","111-8888-2222","111-8888-3333","111-8888-4444","111-8888-5555","111-8888-6666","111-8888-7777","111-8888-8888","111-9999-1111","111-9999-2222","111-9999-3333","111-9999-4444","111-9999-5555","111-9999-6666","111-9999-7777","111-9999-8888","111-0000-0000","111-0000-1111","111-0000-2222","111-0000-3333","111-0000-4444","111-0000-5555","111-0000-6666","111-0000-7777","111-0000-8888","111-0000-9999","222-3333-3333","222-4444-4444","222-5555-5555","222-6666-6666","222-7777-7777","222-9999-9999","222-2222-2222","222-2222-1111","222-2222-3333","222-2222-4444","222-2222-5555","222-2222-6666","222-2222-7777","222-2222-8888","222-2222-9999","222-3333-1111","222-3333-2222","222-3333-4444","222-3333-5555","222-3333-6666","222-3333-7777","222-3333-8888","222-3333-9999","222-4444-1111","222-4444-2222","222-4444-3333","222-4444-5555","222-4444-6666","222-4444-7777","222-4444-8888","222-4444-9999","222-5555-1111","222-5555-2222","222-5555-3333","222-5555-4444","222-5555-6666","222-5555-7777","222-5555-8888","222-5555-9999","222-6666-1111","222-6666-2222","222-6666-3333","222-6666-4444","222-6666-5555","222-6666-7777","222-6666-8888","222-6666-9999","222-7777-1111","222-7777-2222","222-7777-3333","222-7777-4444","222-7777-5555","222-7777-6666","222-7777-8888","222-7777-9999","222-8888-1111","222-8888-2222","222-8888-3333","222-8888-4444","222-8888-5555","222-8888-6666","222-8888-7777","222-8888-8888","222-9999-1111","222-9999-2222","222-9999-3333","222-9999-4444","222-9999-5555","222-9999-6666","222-9999-7777","222-9999-8888","222-0000-0000","222-0000-1111","222-0000-2222","222-0000-3333","222-0000-4444","222-0000-5555","222-0000-6666","222-0000-7777","222-0000-8888","222-0000-9999","333-1111-1111","333-1111-2222","333-1111-3333","333-1111-4444","333-1111-5555","333-1111-6666","333-1111-7777","333-1111-8888","333-1111-9999","333-3333-3333","333-4444-4444","333-5555-5555","333-6666-6666","333-7777-7777","333-2222-2222","333-2222-1111","333-2222-3333","333-2222-4444","333-2222-5555","333-2222-6666","333-2222-7777","333-2222-8888","333-2222-9999","333-3333-1111","333-3333-2222","333-3333-4444","333-3333-5555","333-3333-6666","333-3333-7777","333-3333-8888","333-3333-9999","333-4444-1111","333-4444-2222","333-4444-3333","333-4444-5555","333-4444-6666","333-4444-7777","333-4444-8888","333-4444-9999","333-5555-1111","333-5555-2222","333-5555-3333","333-5555-4444","333-5555-6666","333-5555-7777","333-5555-8888","333-5555-9999","333-6666-1111","333-6666-2222","333-6666-3333","333-6666-4444","333-6666-5555","333-6666-7777","333-6666-8888","333-6666-9999","333-7777-1111","333-7777-2222","333-7777-3333","333-7777-4444","333-7777-5555","333-7777-6666","333-7777-8888","333-7777-9999","333-8888-1111","333-8888-2222","333-8888-3333","333-8888-4444","333-8888-5555","333-8888-6666","333-8888-7777","333-8888-8888","333-9999-1111","333-9999-2222","333-9999-3333","333-9999-4444","333-9999-5555","333-9999-6666","333-9999-7777","333-9999-8888","333-9999-9999","333-0000-0000","333-0000-1111","333-0000-2222","333-0000-3333","333-0000-4444","333-0000-5555","333-0000-6666","333-0000-7777","333-0000-8888","333-0000-9999","444-1111-1111","444-1111-2222","444-1111-3333","444-1111-4444","444-1111-5555","444-1111-6666","444-1111-7777","444-1111-8888","444-1111-9999","444-2222-1111","444-2222-2222","444-2222-3333","444-2222-4444","444-2222-5555","444-2222-6666","444-2222-7777","444-2222-8888","444-2222-9999","444-3333-1111","444-3333-2222","444-3333-3333","444-3333-4444","444-3333-5555","444-3333-6666","444-3333-7777","444-3333-8888","444-3333-9999","444-4444-1111","444-4444-2222","444-4444-3333","444-4444-5555","444-4444-6666","444-4444-7777","444-4444-8888","444-4444-9999","444-5555-1111","444-5555-2222","444-5555-3333","444-5555-4444","444-5555-6666","444-5555-7777","444-5555-8888","444-5555-9999","444-6666-1111","444-6666-2222","444-6666-3333","444-6666-4444","444-6666-5555","444-6666-7777","444-6666-8888","444-6666-9999","444-7777-1111","444-7777-2222","444-7777-3333","444-7777-4444","444-7777-5555","444-7777-6666","444-7777-8888","444-7777-9999","444-8888-1111","444-8888-2222","444-8888-3333","444-8888-4444","444-8888-5555","444-8888-6666","444-8888-7777","444-8888-8888","444-8888-9999","444-9999-1111","444-9999-2222","444-9999-3333","444-9999-4444","444-9999-5555","444-9999-6666","444-9999-7777","444-9999-8888","444-9999-9999","444-0000-0000","444-0000-1111","444-0000-2222","444-0000-3333","444-0000-4444","444-0000-5555","444-0000-6666","444-0000-7777","444-0000-8888","444-0000-9999","555-1111-1111","555-1111-2222","555-1111-3333","555-1111-4444","555-1111-5555","555-1111-6666","555-1111-7777","555-1111-8888","555-1111-9999","555-2222-1111","555-2222-2222","555-2222-3333","555-2222-4444","555-2222-5555","555-2222-6666","555-2222-7777","555-2222-8888","555-2222-9999","555-3333-1111","555-3333-2222","555-3333-3333","555-3333-4444","555-3333-5555","555-3333-6666","555-3333-7777","555-3333-8888","555-3333-9999","555-4444-1111","555-4444-2222","555-4444-3333","555-4444-5555","555-4444-6666","555-4444-7777","555-4444-8888","555-4444-9999","555-5555-1111","555-5555-2222","555-5555-3333","555-5555-4444","555-5555-6666","555-5555-7777","555-5555-8888","555-5555-9999","555-6666-1111","555-6666-2222","555-6666-3333","555-6666-4444","555-6666-5555","555-6666-7777","555-6666-8888","555-6666-9999","555-7777-1111","555-7777-2222","555-7777-3333","555-7777-4444","555-7777-5555","555-7777-6666","555-7777-8888","555-7777-9999","555-8888-1111","555-8888-2222","555-8888-3333","555-8888-4444","555-8888-5555","555-8888-6666","555-8888-7777","555-8888-8888","555-8888-9999","555-9999-1111","555-9999-2222","555-9999-3333","555-9999-4444","555-9999-5555","555-9999-6666","555-9999-7777","555-9999-8888","555-9999-9999","555-0000-0000","555-0000-1111","555-0000-2222","555-0000-3333","555-0000-4444","555-0000-5555","555-0000-6666","555-0000-7777","555-0000-8888","555-0000-9999","666-1111-1111","666-1111-2222","666-1111-3333","666-1111-4444","666-1111-5555","666-1111-6666","666-1111-7777","666-1111-8888","666-1111-9999","666-2222-1111","666-2222-2222","666-2222-3333","666-2222-4444","666-2222-5555","666-2222-6666","666-2222-7777","666-2222-8888","666-2222-9999","666-3333-1111","666-3333-2222","666-3333-3333","666-3333-4444","666-3333-5555","666-3333-6666","666-3333-7777","666-3333-8888","666-3333-9999","666-4444-1111","666-4444-2222","666-4444-3333","666-4444-5555","666-4444-6666","666-4444-7777","666-4444-8888","666-4444-9999","666-5555-1111","666-5555-2222","666-5555-3333","666-5555-4444","666-5555-6666","666-5555-7777","666-5555-8888","666-5555-9999","666-6666-1111","666-6666-2222","666-6666-3333","666-6666-4444","666-6666-5555","666-6666-7777","666-6666-8888","666-6666-9999","666-7777-1111","666-7777-2222","666-7777-3333","666-7777-4444","666-7777-5555","666-7777-6666","666-7777-8888","666-7777-9999","666-8888-1111","666-8888-2222","666-8888-3333","666-8888-4444","666-8888-5555","666-8888-6666","666-8888-7777","666-8888-8888","666-8888-9999","666-9999-1111","666-9999-2222","666-9999-3333","666-9999-4444","666-9999-5555","666-9999-6666","666-9999-7777","666-9999-8888","666-9999-9999","666-0000-0000","666-0000-1111","666-0000-2222","666-0000-3333","666-0000-4444","666-0000-5555","666-0000-6666","666-0000-7777","666-0000-8888","666-0000-9999","777-1111-1111","777-1111-2222","777-1111-3333","777-1111-4444","777-1111-5555","777-1111-6666","777-1111-7777","777-1111-8888","777-1111-9999","777-2222-1111","777-2222-2222","777-2222-3333","777-2222-4444","777-2222-5555","777-2222-6666","777-2222-7777","777-2222-8888","777-2222-9999","777-3333-1111","777-3333-2222","777-3333-3333","777-3333-4444","777-3333-5555","777-3333-6666","777-3333-7777","777-3333-8888","777-3333-9999","777-4444-1111","777-4444-2222","777-4444-3333","777-4444-5555","777-4444-6666","777-4444-7777","777-4444-8888","777-4444-9999","777-5555-1111","777-5555-2222","777-5555-3333","777-5555-4444","777-5555-6666","777-5555-7777","777-5555-8888","777-5555-9999","777-6666-1111","777-6666-2222","777-6666-3333","777-6666-4444","777-6666-5555","777-6666-7777","777-6666-8888","777-6666-9999","777-7777-1111","777-7777-2222","777-7777-3333","777-7777-4444","777-7777-5555","777-7777-6666","777-7777-8888","777-7777-9999","777-8888-1111","777-8888-2222","777-8888-3333","777-8888-4444","777-8888-5555","777-8888-6666","777-8888-7777","777-8888-8888","777-8888-9999","777-9999-1111","777-9999-2222","777-9999-3333","777-9999-4444","777-9999-5555","777-9999-6666","777-9999-7777","777-9999-8888","777-9999-9999","777-0000-0000","777-0000-1111","777-0000-2222","777-0000-3333","777-0000-4444","777-0000-5555","777-0000-6666","777-0000-7777","777-0000-8888","777-0000-9999","888-1111-1111","888-1111-2222","888-1111-3333","888-1111-4444","888-1111-5555","888-1111-6666","888-1111-7777","888-1111-8888","888-1111-9999","888-2222-1111","888-2222-2222","888-2222-3333","888-2222-4444","888-2222-5555","888-2222-6666","888-2222-7777","888-2222-8888","888-2222-9999","888-3333-1111","888-3333-2222","888-3333-3333","888-3333-4444","888-3333-5555","888-3333-6666","888-3333-7777","888-3333-8888","888-3333-9999","888-4444-1111","888-4444-2222","888-4444-3333","888-4444-5555","888-4444-6666","888-4444-7777","888-4444-8888","888-4444-9999","888-5555-1111","888-5555-2222","888-5555-3333","888-5555-4444","888-5555-6666","888-5555-7777","888-5555-8888","888-5555-9999","888-6666-1111","888-6666-2222","888-6666-3333","888-6666-4444","888-6666-5555","888-6666-7777","888-6666-8888","888-6666-9999","888-7777-1111","888-7777-2222","888-7777-3333","888-7777-4444","888-7777-5555","888-7777-6666","888-7777-8888","888-7777-9999","888-8888-1111","888-8888-2222","888-8888-3333","888-8888-4444","888-8888-5555","888-8888-6666","888-8888-7777","888-8888-8888","888-8888-9999","888-9999-1111","888-9999-2222","888-9999-3333","888-9999-4444","888-9999-5555","888-9999-6666","888-9999-7777","888-9999-8888","888-9999-9999","888-0000-0000","888-0000-1111","888-0000-2222","888-0000-3333","888-0000-4444","888-0000-5555","888-0000-6666","888-0000-7777","888-0000-8888","888-0000-9999","999-1111-1111","999-1111-2222","999-1111-3333","999-1111-4444","999-1111-5555","999-1111-6666","999-1111-7777","999-1111-8888","999-1111-9999","999-2222-1111","999-2222-2222","999-2222-3333","999-2222-4444","999-2222-5555","999-2222-6666","999-2222-7777","999-2222-8888","999-2222-9999","999-3333-1111","999-3333-2222","999-3333-3333","999-3333-4444","999-3333-5555","999-3333-6666","999-3333-7777","999-3333-8888","999-3333-9999","999-4444-1111","999-4444-2222","999-4444-3333","999-4444-5555","999-4444-6666","999-4444-7777","999-4444-8888","999-4444-9999","999-5555-1111","999-5555-2222","999-5555-3333","999-5555-4444","999-5555-6666","999-5555-7777","999-5555-8888","999-5555-9999","999-6666-1111","999-6666-2222","999-6666-3333","999-6666-4444","999-6666-5555","999-6666-7777","999-6666-8888","999-6666-9999","999-7777-1111","999-7777-2222","999-7777-3333","999-7777-4444","999-7777-5555","999-7777-6666","999-7777-8888","999-7777-9999","999-8888-1111","999-8888-2222","999-8888-3333","999-8888-4444","999-8888-5555","999-8888-6666","999-8888-7777","999-8888-8888","999-8888-9999","999-9999-1111","999-9999-2222","999-9999-3333","999-9999-4444","999-9999-5555","999-9999-6666","999-9999-7777","999-9999-8888","999-9999-9999","999-0000-0000","999-0000-1111","999-0000-2222","999-0000-3333","999-0000-4444","999-0000-5555","999-0000-6666","999-0000-7777","999-0000-8888","999-0000-9999","000-1111-1111","000-1111-2222","000-1111-3333","000-1111-4444","000-1111-5555","000-1111-6666","000-1111-7777","000-1111-8888","000-1111-9999","000-2222-1111","000-2222-2222","000-2222-3333","000-2222-4444","000-2222-5555","000-2222-6666","000-2222-7777","000-2222-8888","000-2222-9999","000-3333-1111","000-3333-2222","000-3333-3333","000-3333-4444","000-3333-5555","000-3333-6666","000-3333-7777","000-3333-8888","000-3333-9999","000-4444-1111","000-4444-2222","000-4444-3333","000-4444-5555","000-4444-6666","000-4444-7777","000-4444-8888","000-4444-9999","000-5555-1111","000-5555-2222","000-5555-3333","000-5555-4444","000-5555-6666","000-5555-7777","000-5555-8888","000-5555-9999","000-6666-1111","000-6666-2222","000-6666-3333","000-6666-4444","000-6666-5555","000-6666-7777","000-6666-8888","000-6666-9999","000-7777-1111","000-7777-2222","000-7777-3333","000-7777-4444","000-7777-5555","000-7777-6666","000-7777-8888","000-7777-9999","000-8888-1111","000-8888-2222","000-8888-3333","000-8888-4444","000-8888-5555","000-8888-6666","000-8888-7777","000-8888-8888","000-8888-9999","000-9999-1111","000-9999-2222","000-9999-3333","000-9999-4444","000-9999-5555","000-9999-6666","000-9999-7777","000-9999-8888","000-9999-9999","000-0000-0000","000-0000-1111","000-0000-2222","000-0000-3333","000-0000-4444","000-0000-5555","000-0000-6666","000-0000-7777","000-0000-8888","000-0000-9999","02-1111-1111","02-1111-2222","02-1111-3333","02-1111-4444","02-1111-5555","02-1111-6666","02-1111-7777","02-1111-8888","02-1111-9999","02-2222-1111","02-2222-2222","02-2222-3333","02-2222-4444","02-2222-5555","02-2222-6666","02-2222-7777","02-2222-8888","02-2222-9999","02-3333-1111","02-3333-2222","02-3333-3333","02-3333-4444","02-3333-5555","02-3333-6666","02-3333-7777","02-3333-8888","02-3333-9999","02-4444-1111","02-4444-2222","02-4444-3333","02-4444-5555","02-4444-6666","02-4444-7777","02-4444-8888","02-4444-9999","02-5555-1111","02-5555-2222","02-5555-3333","02-5555-4444","02-5555-6666","02-5555-7777","02-5555-8888","02-5555-9999","02-6666-1111","02-6666-2222","02-6666-3333","02-6666-4444","02-6666-5555","02-6666-7777","02-6666-8888","02-6666-9999","02-7777-1111","02-7777-2222","02-7777-3333","02-7777-4444","02-7777-5555","02-7777-6666","02-7777-8888","02-7777-9999","02-8888-1111","02-8888-2222","02-8888-3333","02-8888-4444","02-8888-5555","02-8888-6666","02-8888-7777","02-8888-8888","02-8888-9999","02-9999-1111","02-9999-2222","02-9999-3333","02-9999-4444","02-9999-5555","02-9999-6666","02-9999-7777","02-9999-8888","02-9999-9999","02-0000-0000","02-0000-1111","02-0000-2222","02-0000-3333","02-0000-4444","02-0000-5555","02-0000-6666","02-0000-7777","02-0000-8888","02-0000-9999","011-1111-1111","011-1111-2222","011-1111-3333","011-1111-4444","011-1111-5555","011-1111-6666","011-1111-7777","011-1111-8888","011-1111-9999","011-2222-1111","011-2222-2222","011-2222-3333","011-2222-4444","011-2222-5555","011-2222-6666","011-2222-7777","011-2222-8888","011-2222-9999","011-3333-1111","011-3333-2222","011-3333-3333","011-3333-4444","011-3333-5555","011-3333-6666","011-3333-7777","011-3333-8888","011-3333-9999","011-4444-1111","011-4444-2222","011-4444-3333","011-4444-5555","011-4444-6666","011-4444-7777","011-4444-8888","011-4444-9999","011-5555-1111","011-5555-2222","011-5555-3333","011-5555-4444","011-5555-6666","011-5555-7777","011-5555-8888","011-5555-9999","011-6666-1111","011-6666-2222","011-6666-3333","011-6666-4444","011-6666-5555","011-6666-7777","011-6666-8888","011-6666-9999","011-7777-1111","011-7777-2222","011-7777-3333","011-7777-4444","011-7777-5555","011-7777-6666","011-7777-8888","011-7777-9999","011-8888-1111","011-8888-2222","011-8888-3333","011-8888-4444","011-8888-5555","011-8888-6666","011-8888-7777","011-8888-8888","011-8888-9999","011-9999-1111","011-9999-2222","011-9999-3333","011-9999-4444","011-9999-5555","011-9999-6666","011-9999-7777","011-9999-8888","011-9999-9999","011-0000-0000","011-0000-1111","011-0000-2222","011-0000-3333","011-0000-4444","011-0000-5555","011-0000-6666","011-0000-7777","011-0000-8888","011-0000-9999","016-1111-1111","016-1111-2222","016-1111-3333","016-1111-4444","016-1111-5555","016-1111-6666","016-1111-7777","016-1111-8888","016-1111-9999","016-2222-1111","016-2222-2222","016-2222-3333","016-2222-4444","016-2222-5555","016-2222-6666","016-2222-7777","016-2222-8888","016-2222-9999","016-3333-1111","016-3333-2222","016-3333-3333","016-3333-4444","016-3333-5555","016-3333-6666","016-3333-7777","016-3333-8888","016-3333-9999","016-4444-1111","016-4444-2222","016-4444-3333","016-4444-5555","016-4444-6666","016-4444-7777","016-4444-8888","016-4444-9999","016-5555-1111","016-5555-2222","016-5555-3333","016-5555-4444","016-5555-6666","016-5555-7777","016-5555-8888","016-5555-9999","016-6666-1111","016-6666-2222","016-6666-3333","016-6666-4444","016-6666-5555","016-6666-7777","016-6666-8888","016-6666-9999","016-7777-1111","016-7777-2222","016-7777-3333","016-7777-4444","016-7777-5555","016-7777-6666","016-7777-8888","016-7777-9999","016-8888-1111","016-8888-2222","016-8888-3333","016-8888-4444","016-8888-5555","016-8888-6666","016-8888-7777","016-8888-8888","016-8888-9999","016-9999-1111","016-9999-2222","016-9999-3333","016-9999-4444","016-9999-5555","016-9999-6666","016-9999-7777","016-9999-8888","016-9999-9999","016-0000-0000","016-0000-1111","016-0000-2222","016-0000-3333","016-0000-4444","016-0000-5555","016-0000-6666","016-0000-7777","016-0000-8888","016-0000-9999","019-1111-1111","019-1111-2222","019-1111-3333","019-1111-4444","019-1111-5555","019-1111-6666","019-1111-7777","019-1111-8888","019-1111-9999","019-2222-1111","019-2222-2222","019-2222-3333","019-2222-4444","019-2222-5555","019-2222-6666","019-2222-7777","019-2222-8888","019-2222-9999","019-3333-1111","019-3333-2222","019-3333-3333","019-3333-4444","019-3333-5555","019-3333-6666","019-3333-7777","019-3333-8888","019-3333-9999","019-4444-1111","019-4444-2222","019-4444-3333","019-4444-5555","019-4444-6666","019-4444-7777","019-4444-8888","019-4444-9999","019-5555-1111","019-5555-2222","019-5555-3333","019-5555-4444","019-5555-6666","019-5555-7777","019-5555-8888","019-5555-9999","019-6666-1111","019-6666-2222","019-6666-3333","019-6666-4444","019-6666-5555","019-6666-7777","019-6666-8888","019-6666-9999","019-7777-1111","019-7777-2222","019-7777-3333","019-7777-4444","019-7777-5555","019-7777-6666","019-7777-8888","019-7777-9999","019-8888-1111","019-8888-2222","019-8888-3333","019-8888-4444","019-8888-5555","019-8888-6666","019-8888-7777","019-8888-8888","019-8888-9999","019-9999-1111","019-9999-2222","019-9999-3333","019-9999-4444","019-9999-5555","019-9999-6666","019-9999-7777","019-9999-8888","019-9999-9999","019-0000-0000","019-0000-1111","019-0000-2222","019-0000-3333","019-0000-4444","019-0000-5555","019-0000-6666","019-0000-7777","019-0000-8888","019-0000-9999"};
					
					if(Arrays.asList(vaildPhone).contains(phone))
					{
						ModelAndView mav = new ModelAndView();
				    	mav.addObject("result", "NOT PHONE");
						mav.setViewName("jsonView");

						return mav; 
					}
				}
				else
				{
					if(tlt.equals("이름"))
					{
						if(val.length() <= 1) 
						{
							ModelAndView mav = new ModelAndView();
					    	mav.addObject("result", "NOT NAME");
							mav.setViewName("jsonView");

							return mav;
						}
						if(val.matches(".*[a-zA-Z0-9]+.*")) 
						{
							ModelAndView mav = new ModelAndView();
					    	mav.addObject("result", "NOT NAME");
							mav.setViewName("jsonView");

							return mav;
						}
						if(val.matches(".*[ㄱㄲㄴㄷㄸㄹㅁㅂㅃㅅㅆㅇㅈㅉㅊㅋㅌㅍㄹㅎ]+.*")) 
						{
							ModelAndView mav = new ModelAndView();
					    	mav.addObject("result", "NOT NAME");
							mav.setViewName("jsonView");

							return mav;
						}
						String[] vaildName = {"깡패","돌아이","도라이","폭주족","10새","10새기","10새리","10세리","10쉐이","10쉑","10스","10쌔","10쌔기","10쎄","10알","10창","10탱","18것","18넘","18년","18노","18놈","18뇬","18럼","18롬","18새","18새끼","18색","18세끼","18세리","18섹","18쉑","18스","18아","갈보","갈보년","강아지","같은년","같은뇬","개같은","개구라","개년","개놈","개뇬","개대중","개독","개돼중","개랄","개보지","개뻥","개뿔","개새","개새기","개새끼","개새키","개색기","개색끼","개색키","개색히","개섀끼","개세","개세끼","개세이","개소리","개쑈","개쇳기","개수작","개쉐","개쉐리","개쉐이","개쉑","개쉽","개스끼","개시키","개십새기","개십새끼","개쐑","개씹","개아들","개자슥","개자지","개접","개좆","개좌식","개허접","걔새","걔수작","걔시끼","걔시키","걔썌","걸레","게색기","게색끼","광뇬","구녕","구라","구멍","그년","그새끼","냄비","놈현","뇬","눈깔","뉘미럴","니귀미","니기미","니미","니미랄","니미럴","니미씹","니아배","니아베","니아비","니어매","니어메","니어미","닝기리","닝기미","대가리","뎡신","도라이","돈놈","돌아이","돌은놈","되질래","뒈져","뒈져라","뒈진","뒈진다","뒈질","뒤질래","등신","디져라","디진다","디질래","딩시","따식","때놈","또라이","똘아이","똘아이","뙈놈","뙤놈","뙨넘","뙨놈","뚜쟁","띠바","띠발","띠불","띠팔","메친넘","메친놈","미췬","미췬","미친","미친넘","미친년","미친놈","미친새끼","미친스까이","미틴","미틴넘","미틴년","미틴놈","바랄년","병자","뱅마","뱅신","벼엉신","병쉰","병신","부랄","부럴","불알","불할","붕가","붙어먹","뷰웅","븅","븅신","빌어먹","빙시","빙신","빠가","빠구리","빠굴","빠큐","뻐큐","뻑큐","뽁큐","상넘이","상놈을","상놈의","상놈이","새갸","새꺄","새끼","새새끼","새키","색끼","생쑈","세갸","세꺄","세끼","섹스","쇼하네","쉐","쉐기","쉐끼","쉐리","쉐에기","쉐키","쉑","쉣","쉨","쉬발","쉬밸","쉬벌","쉬뻘","쉬펄","쉽알","스패킹","스팽","시궁창","시끼","시댕","시뎅","시랄","시발","시벌","시부랄","시부럴","시부리","시불","시브랄","시팍","시팔","시펄","신발끈","심발끈","심탱","십8","십라","십새","십새끼","십세","십쉐","십쉐이","십스키","십쌔","십창","십탱","싶알","싸가지","싹아지","쌉년","쌍넘","쌍년","쌍놈","쌍뇬","쌔끼","쌕","쌩쑈","쌴년","썅","썅년","썅놈","썡쇼","써벌","썩을년","썩을놈","쎄꺄","쎄엑","쒸벌","쒸뻘","쒸팔","쒸펄","쓰바","쓰박","쓰발","쓰벌","쓰팔","씁새","씁얼","씌파","씨8","씨끼","씨댕","씨뎅","씨바","씨바랄","씨박","씨발","씨방","씨방새","씨방세","씨밸","씨뱅","씨벌","씨벨","씨봉","씨봉알","씨부랄","씨부럴","씨부렁","씨부리","씨불","씨붕","씨브랄","씨빠","씨빨","씨뽀랄","씨앙","씨파","씨팍","씨팔","씨펄","씸년","씸뇬","씸새끼","씹같","씹년","씹뇬","씹보지","씹새","씹새기","씹새끼","씹새리","씹세","씹쉐","씹스키","씹쌔","씹이","씹자지","씹질","씹창","씹탱","씹퇭","씹팔","씹할","씹헐","아가리","아갈","아갈이","아갈통","아구창","아구통","아굴","얌마","양넘","양년","양놈","엄창","엠병","여물통","염병","엿같","옘병","옘빙","오입","왜년","왜놈","욤병","육갑","은년","을년","이년","이새끼","이새키","이스끼","이스키","임마","자슥","잡것","잡넘","잡년","잡놈","저년","저새끼","접년","젖밥","조까","조까치","조낸","조또","조랭","조빠","조쟁이","조지냐","조진다","조찐","조질래","존나","존나게","존니","존만","존만한","좀물","좁년","좁밥","좃까","좃또","좃만","좃밥","좃이","좃찐","좆같","좆까","좆나","좆또","좆만","좆밥","좆이","좆찐","좇같","좇이","좌식","주글","주글래","주데이","주뎅","주뎅이","주둥아리","주둥이","주접","주접떨","죽고잡","죽을래","죽통","쥐랄","쥐롤","쥬디","지랄","지럴","지롤","지미랄","짜식","짜아식","쪼다","쫍빱","찌랄","창녀","캐년","캐놈","캐스끼","캐스키","캐시키","탱구","팔럼","퍽큐","호로","호로놈","호로새끼","호로색","호로쉑","호로스까이","호로스키","후라들","후래자식","후레","후뢰"};
						if(Arrays.asList(vaildName).contains(val))
						{
							ModelAndView mav = new ModelAndView();
					    	mav.addObject("result", "NOT NAME");
							mav.setViewName("jsonView");

							return mav; 
						}
					}
					fupValue += "{\"TITLE\":\""+ tlt +"\",\"KEY\":\""+ key +"\",\"VALUE\":\""+ val +"\"}";
				}
			}
			fupValue += "]";
		
			//benefit setting
			fupValue += ",";
			fupValue += "\"BENEFIT\":";
			fupValue += "{";
			fupValue += "\"FB_SEQ\":\""+ emfMap.getString("fuBenefitSeq") +"\",";
			fupValue += "\"FB_TITLE\":\""+ emfMap.getString("fuBenefitTitle") +"\",";
			fupValue += "\"FB_SUBTITLE\":\""+ emfMap.getString("fuBenefitSubtitle") +"\",";
			fupValue += "\"FB_MODEL\":\""+ emfMap.getString("fuBenefitModel") +"\",";
			fupValue += "\"FB_PRICE\":\""+ emfMap.getString("uBenefitPrice") +"\",";
			fupValue += "\"FB_IMAGE_W_PATH\":\""+ emfMap.getString("fuBenefitPath") +"\",";
			fupValue += "\"FB_IMAGE_W_SAVE_NM\":\""+ emfMap.getString("fuBenefitSave") +"\",";
			fupValue += "\"FB_IMAGE_W_REAL_NM\":\""+ emfMap.getString("fuBenefitReal") +"\"";
			fupValue += "}";
			
			//price setting
			fupValue += ",\"PRICE\":\""+ emfMap.getString("fuPrice") +"\"";
			fupValue += "}";
			
			//fromurl setting
			String getFromurl = "";
			if(!emfMap.getString("fromurl").isEmpty()) 
			{
				getFromurl = emfMap.getString("fromurl");
			}
			else
			{
				
				Cookie[] cookies = request.getCookies();
				if (cookies != null) {
					for (Cookie cookie : cookies) {
						if (cookie.getName().equals("fromurl")) {
							getFromurl = cookie.getValue();     
						}
					}
				}
			}
			
			//emfMap setting
			rqstMap.put("FUP_SEQ", fariUserIdgen.getNextIntegerId());
			rqstMap.put("FUP_VALUE", fupValue);
			rqstMap.put("FAIR_PRODUCT_FP_SEQ", emfMap.getString("fairProductFpSeq"));
			rqstMap.put("FUP_FROMURL", getFromurl);
			
			fairMainService.insertUser(rqstMap);
			
		}
    	catch (Exception he) 
		{
			if (log.isDebugEnabled()) 
			{
				log.debug(he);
            }
			throw new EmfException(he.getMessage());
		}
    	
    	ModelAndView mav = new ModelAndView();
    	mav.addObject("result", "OK");
		mav.setViewName("jsonView");

		return mav; 
    }
    
    
    /**
	 * 메인 미리보기 화면
	 *
 	 * @param emfMap
	 * @param modelMap
	 * @return
	 * @throws Exception
	 */
	@RequestMapping(value="/preview.do")
	public String FairMainPreview(HttpServletRequest request, EmfMap emfMap, ModelMap modelMap) throws Exception
	{
		try
		{
			//전체설정
			List<EmfMap> configList = fairMainService.configList();
			EmfMap config = new EmfMap();
			if(configList.size() > 0)
			{
				config = configList.get(0);
			}
			modelMap.addAttribute("config", config);
			//배너
			int bannerHeight = 0;
			List<EmfMap> bannerList = fairMainService.selectBanner();
			for(EmfMap bl : bannerList)
			{
				BufferedImage imgBanner = ImageIO.read(new File(bl.getString("fbtImageBgPath")+"/"+bl.getString("fbtImageWSaveNm")));
				if(imgBanner.getHeight() > bannerHeight) {
					bannerHeight = imgBanner.getHeight();
				}
			}
			modelMap.addAttribute("bannerHeight", bannerHeight);
			modelMap.addAttribute("bannerList", bannerList);
			
			//소구포인트
			int pointHeight = 0;
			List<EmfMap> points = fairMainService.selectPoint();
			EmfMap point = new EmfMap();
			if(points.size() > 0)
			{
				point = points.get(0);
				BufferedImage imgPoint = ImageIO.read(new File(point.getString("fmImageBgPath")+"/"+point.getString("fmImageBgSaveNm")));
				pointHeight = imgPoint.getHeight();

				List<EmfMap> pointSubList = fairMainService.selectPointList();
				for(EmfMap psl : pointSubList)
				{
					psl.put("fmsDesc", psl.getString("fmsDesc").replaceAll("\r\n", "<br>"));
				}
				
				modelMap.addAttribute("pointHeight", pointHeight);
				modelMap.addAttribute("point", point);
				modelMap.addAttribute("pointSubList", pointSubList);
			}
			
			//카테고리 & 상품
			List<EmfMap> cateList = fairMainService.selectCategory();
			for(EmfMap cl : cateList)
			{
				cl.put("fcSubtitle", cl.getString("fcSubtitle").replaceAll("\r\n", "<br>"));

				//상품
				EmfMap param = new EmfMap();
				param.put("fcMainMaxCount", cl.getString("fcMainMaxCount"));
				param.put("fcSeq", cl.getString("fcSeq"));
				List<EmfMap> product = fairMainService.selectProduct(param);
				for(EmfMap pl : product)
				{
					BufferedImage imgProduct = ImageIO.read(new File(pl.getString("fpMainImageBgPath")+"/"+pl.getString("fpMainImageBgSaveNm")));
					pl.put("fpMainHeight", imgProduct.getHeight());
					
					pl.put("fpMainSubtitle", pl.getString("fpMainSubtitle").replaceAll("\r\n", "<br>"));
					pl.put("fpMainDesc", pl.getString("fpMainDesc").replaceAll("\r\n", "<br>"));
				}
				
				cl.put("productList", product);
			}
			modelMap.addAttribute("cateList", cateList);
			
			//이벤트
			List<EmfMap> eventList = fairMainService.selectEvent();
			modelMap.addAttribute("eventList", eventList);
		}
		catch (Exception he) 
		{
			if (log.isDebugEnabled()) 
			{
				log.debug(he);
            }
			throw new EmfException(he.getMessage());
		} 		
		
		String url = "front/fair/FairPreviewMain";
		
		//모바일 체크
		String userAgent = (String)request.getHeader("User-Agent");
		String[] mobileos = {"iPhone","iPod","Android","BlackBerry","Windows CE",
		"Nokia","Webos","Opera Mini","SonyEricsson","Opera Mobi","IEMobile"};
		int j = -1;
		if(userAgent != null && !userAgent.equals("")){
			for(int i = 0 ; i<mobileos.length ; i++){
				j = userAgent.indexOf(mobileos[i]);
				if(j > -1){
					url = "front/fair/FairPreviewMainMo";
				}
			}
		}
		return url;
	}
	
	/**
	 * 상세 미리보기 화면
	 *
 	 * @param emfMap
	 * @param modelMap
	 * @return
	 * @throws Exception
	 */
	@RequestMapping(value="/{fpSeq}/preview_detail.do")
	public String FairPreviewDetail(HttpServletRequest request, EmfMap emfMap, ModelMap modelMap, @PathVariable int fpSeq) throws Exception
	{
		try
		{
			//전체설정
			List<EmfMap> configList = fairMainService.configList();
			EmfMap config = new EmfMap();
			if(configList.size() > 0)
			{
				config = configList.get(0);
			}
			modelMap.addAttribute("config", config);
			
			emfMap.put("fpSeq", fpSeq);
			List<EmfMap> product = fairMainService.selectProductDetail(emfMap);
			if(product.size() > 0) {
				EmfMap rtnMap = product.get(0);
				rtnMap.put("fpMainSubtitle", rtnMap.getString("fpMainSubtitle").replaceAll("\r\n", " "));
				modelMap.addAttribute("product", product.get(0));
			}
		}
		catch (Exception he) 
		{
			if (log.isDebugEnabled()) 
			{
				log.debug(he);
            }
			throw new EmfException(he.getMessage());
		}
		
		String url = "front/fair/FairPreviewDetail";
    	
    	//모바일 체크
		String userAgent = (String)request.getHeader("User-Agent");
		String[] mobileos = {"iPhone","iPod","Android","BlackBerry","Windows CE",
		"Nokia","Webos","Opera Mini","SonyEricsson","Opera Mobi","IEMobile"};
		int j = -1;
		if(userAgent != null && !userAgent.equals("")){
			for(int i = 0 ; i<mobileos.length ; i++){
				j = userAgent.indexOf(mobileos[i]);
				if(j > -1){
					url = "front/fair/FairPreviewDetailMo";
				}
			}
		}
		return url;
	}
}
