<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>


<div class="ceoDiv">
							<p class="img"><img src="/common/images/icon/ceoimg.jpg" alt=""></p>
							<div class="txt">
								<p class="type1">대명라이프웨이는 고객님의 희로애락의 모든 순간에 동행하며, 행복한 삶과 풍요로운 내일을 만들어 가겠습니다.</p>
								<div class="">
									대명라이프웨이를 방문해주신 고객 여러분! 반갑습니다. <br>대명라이프웨이는 지난 30년 이상 국내 레저사업을 이끌어온 대명그룹의 서비스노하우를 바탕으로 2010년 12월에 설립된 ㈜대명스테이션의 대표 브랜드입니다.<br><br>2015년 대명라이프웨이는 혁신적 비즈니스를 통해 고객에게 최상의 상조서비스는 물론 웨딩, 여행, 유아교육, 이사 등 새로운 전환서비스를 선보였습니다. <br>2012년, 가입 고객에게 혜택을 돌려주자는 의도로 시작된 대명라이프웨이만의 비즈니스 모델이 상조업계의 표준 모델로 자리 잡아 가고 있는 것에 대해 뿌듯함을 느끼고 있습니다. <br>앞으로도 고객 혜택 및 멤버십 서비스를 강화하여 새로운 변화를 일으킬 예정입니다. <br><br>이에 대명라이프웨이는 2016년부터 품질 경영을 선포하고 CRM을 통해 고객들에게 최상의 만족을 제공하고자 합니다. 또한 사업 초기부터 지속적으로 표명해 온 ‘컬러풀 스테이션 서비스(Colorful station service)’의 가치를 더욱 공고히 하여, 많은 사랑을 받는 기업이 되도록 하겠습니다. <br><br>“고객의 다양한 Needs를 파악하고, 그 Insight를 통하여 고객이 진정 바라는 서비스를 현실화 하는 것!” <br>그것이 대명라이프웨이가 이루어가야 할 고객 분들을 위한 최고의 가치입니다.
									<p class="mt40 taR"><img src="/common/images/txt/ceotxt.gif" alt="㈜대명스테이션 대표이사 - 권광수"></p>
								</div>
							</div>
						</div>

