<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>


<div class="ceoDiv">
							<p class="img"><img src="/common/images/icon/ceoimg.jpg" alt=""></p>
							<div class="txt">
								<p class="type1">‘상조에 원하는 생활 서비스를 더하다’<br>대명라이프웨이의 새로운 이름, <b>‘대명아임레디’</b>가 더 새롭고 즐거운 라이프웨이를 위해 함께 합니다.</p>
								<div class="">
									안녕하십니까? ㈜대명스테이션 대표이사 권광수입니다. <br>

40년 대명그룹의 고객서비스 노하우를 기반으로 성장해 온 대명라이프웨이가 2018년 5월, 대명아임레디로 새롭게 태어났습니다.<br><br>

대명의 상조는 고객에게 믿음을 주는 최상의 상조를 바탕으로 갖고 싶던 물건을 합리적으로 구매할 수 있고, 여행과 공부, 결혼 등 하고 싶은 것을 필요한 때에 할 수 있도록 돕는 ‘친근하고 혁신적인 상조’로, 상조서비스를 새로운 라이프 서비스로 진화시켰다는 자부심을 갖고 있습니다. <br><br>

새롭고 즐거운 라이프웨이를 위한 대명의 새로운 브랜드, 대명아임레디. <br>
대명아임레디는 미래를 준비하는 상조서비스에 지금의 나에게 필요한 생활서비스를 더하여 고객이 필요한 때에 직접 선택해서 누릴 수 있는 고객중심서비스를 지향합니다. 또한 고객과의 소통을 통해 고객의 니즈를 지속적으로 반영하여 더욱 진화, 발전하는 하이브리드 상조서비스를 목표로 하고 있습니다. <br><br>

대명의 품질경영과 CRM기반의 고객서비스를 통해 4년 연속 상조서비스부문 명품브랜드 대상을 수상하며 그 가치를 인정받은 브랜드로서, 상조의 새로운 기준을 세운다는 사명감으로 대명아임레디는 고객 여러분께서 원하는 더 새롭고 즐거운 라이프웨이를 위해 오늘도 한 걸음 나아가겠습니다. <br><br>
고객 여러분의 지속적인 관심과 사랑을 부탁 드립니다. <br><br>

감사합니다.

									<p class="mt40 taR"><img src="/common/images/txt/ceotxt.gif" alt="㈜대명스테이션 대표이사 - 권광수"></p>
								</div>
							</div>
						</div>

